import Modal from "../../Common/Modal";

interface ITermsAndConditionsProbs {
  isVisible: boolean;
  onClose: () => void;
}
const TermsAndConditions: React.FC<ITermsAndConditionsProbs> = ({
  isVisible,
  onClose,
}): JSX.Element => {
  const child = (
    <div className="px-xl py-xs flex flex-col gap-xs font-[16px]  leading-relaxed">
      <p>
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
        از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
        متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
        درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد.
      </p>
      <ul className="list-disc pr-m">
        <li>
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
          استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
          ستون و سطرآنچنان که لازم است،{" "}
        </li>
        <li>
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
          استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
          ستون و سطرآنچنان که لازم است،{" "}
        </li>
        <li>
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
          استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
          ستون و سطرآنچنان که لازم است،{" "}
        </li>
        <li>
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
          استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
          ستون و سطرآنچنان که لازم است،{" "}
        </li>
        <li>
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
          استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
          ستون و سطرآنچنان که لازم است،{" "}
        </li>
      </ul>
    </div>
  );

  return (
    <Modal
      currentPage={1}
      mBody={child}
      totalPages={1}
      modalTitle="قوانین و مقررات"
      hasPaginationBulet={false}
      hasFooter={false}
      mBodyStyle="justify-center"
      isVisible={isVisible}
      onClose={onClose}
      width={800}
    />
  );
};

export default TermsAndConditions;
